In [1]:
import pandas as pd

In [2]:
pd.read_excel(r'C:\Users\HP\Desktop\Data Science\Temp files\Dataset1.xlsx')

      Name     Batch   Roll No    Address
0    Ahmed  Python 12     2541      Adoni
1  Basheer    Java 13     7541  Hyderabad
2   George   Oracle15     9632  Bangalore

In [3]:
pd.read_csv(r'C:\Users\HP\Desktop\Data Science\Temp files\dataset2.csv')

       Name     Batch   Roll No    Address
0     Ahmed  Python 12     2541      Adoni
1   Basheer    Java 13     7541  Hyderabad
2    George   Oracle15     9632  Bangalore
3    Martin        FUW     3652     Oregon
4  Jennifer  Python 12     8475      Texas

# for TSV file also you have use CSV only

In [12]:
pd.read_csv(r'C:\Users\HP\Desktop\Data Science\Temp files\dataset3.tsv')

        Name\tBatch\tCity\tphonenumber
0          Ahmed\tba251\tAdoni\t125463
1  George\tpython12\tHyderabad\t854631

# (we use this delimiter separator) ,sep='\t'

In [11]:
pd.read_csv(r'C:\Users\HP\Desktop\Data Science\Temp files\dataset3.tsv',sep='\t')

     Name     Batch       City  phonenumber
0   Ahmed     ba251      Adoni       125463
1  George  python12  Hyderabad       854631

# Another library OS stands for Operating System

In [13]:
import os

os.getcwd()

In [ ]:
# Here you no need to give full path only file name+ file type

In [15]:
import pandas as pd

In [19]:
pd.read_excel('Dataset1.xlsx')

      Name     Batch   Roll No    Address
0    Ahmed  Python 12     2541      Adoni
1  Basheer    Java 13     7541  Hyderabad
2   George   Oracle15     9632  Bangalore